rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "release_date", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "T"], ["rating", "R"], ["release_date", "2010-09-09 00:00:00.000000"], ["director", "D"], ["created_at", "2018-10-05 03:23:18.141525"], ["updated_at", "2018-10-05 03:23:18.141525"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "Star Wars"]]
---
  def search
    @similar_movies = Movie.similar_movies(params[:title])
    if @similar_movies.nil?
      redirect_to movies_path, alert: "'#{params[:title]}' has no director info"
    end
    @movie = Movie.find_by(title: params[:title])